app/controllers/articles_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
INSERT INTO "articles" ("user_id", "movie_id", "article", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "9"], ["movie_id", "31"], ["article", "lalalalalalalalla"], ["created_at", "2020-07-14 22:10:00.052923"], ["updated_at", "2020-07-14 22:10:00.052923"]]
---
  def create
    @article = Article.new(article_params)
    @movie = Movie.find(params[:movie_id])
    @article.movie = @movie
    @article.user = @current_user
    if @article.save

UPDATE "articles" SET "article" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["article", "Colin Malcol.m"], ["updated_at", "2020-07-18 19:21:35.018157"], ["id", 1]]
---
  def update
    if @article.update(article_params)